Revit 2027 API
FabricationPart.PartStatus Property
 The status identifier for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PartStatus { get; set; }
Public Property PartStatus As Integer
	Get
	Set
public:
property int PartStatus {
	int get ();
	void set (int value);
}
member PartStatus : int with get, set
Property Value
Int32
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace